Ewalk02/AquaFeeder/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# HTTP server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
CONFIG_HTTPD_MAX_URI_LEN=512

# cJSON via json component
CONFIG_ESP_ERR_TO_NAME_LOOKUP=y

# Stepper: 1/8 microstep (MS1/MS2 low), 10 RPM shaft
CONFIG_STEPPER_MICROSTEPS=8
CONFIG_STEPPER_TEST_RPM=10
CONFIG_STEPPER_STEP_PULSE_US=1000
CONFIG_STEPPER_EN_ACTIVE_LOW=y
CONFIG_STEPPER_DIR_INVERT=y
